Repository: igoral5/mapi
Catalog: po/*.po
Languages: ru

source: An exception occurred:
ru: Возникло исключение:

source: An unknown exception
ru: Неизвестное исключение

source: Test 1 Creating empty object:
ru: Тест 1 Создание пустого объекта:

source: OK
ru: ОК

source: Test 2 Creating object from a range of iterators:
ru: Тест 2 Создание объекта из диапазона итераторов:

source: Test 3 Creating object from mapi:
ru: Тест 3 Создание объекта из mapi:

source: Test 4 Creating object from map:
ru: Тест 4 Создание объекта из map:

source: Test 5 Assigning object mapi:
ru: Тест 5 Присвоение из объекта mapi:

source: Test 6 Assigning object map:
ru: Тест 6 Присвоение из объекта map:

source: Test 7 Creating const object:
ru: Тест 7 Создание константного объекта:

source: Test 8 Inserting value:
ru: Тест 8 Вставка значения:

source: Test 9 Inserting value with hint position:
ru: Тест 9 Вставка значения с подсказкой положения:

source: Test 10 Inserting from a range of iterators:
ru: Тест 10 Вставка из диапазона итераторов:

source: Test 11 Deleting by value:
ru: Тест 11 Удаление по значению:

source: Test 12 Deleting by iterator:
ru: Тест 12 Удаление по итератору:

source: Test 13 Deleting by range of iterators:
ru: Тест 13 Удаление по диапазону итераторов:

source: Test 14 Find by value:
ru: Тест 14 Поиск по значению:

source: Test 15 Check thread safety:
ru: Тест 15 Проверка потокобезопасности:

source: tested
ru: проверено

source: times OK
ru: раз ОК
